In [1]:
import pandas as pd

df = pd.read_csv("Toyota.csv", index_col=0, na_values=['??', '????'])

In [2]:
df2 = df.copy()
df2.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170

# Identifying missing values
<li circle> In pandas dataframes, missing data is represented by Nan.</li>
<li circle> To check null values in Pandas dataframe,isnull() and isna() are used.</li>

In [4]:
# df2.isnull()
df2.isnull().head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False

In [5]:
# df2.isna()
df2.isna().head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False

In [6]:
df2.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [7]:
df2.isna().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

we have to check our dataframe in missing values why ,becoz suppose if the age has 100 missing values and this fuel type has also 100 missing values. so, if the rows are same for both age and fuel type. so, if they are same and if they are same for all of this means suppose if the minimum value of the missing rows is six in HP. so, if six values are common in this age, kilometer, fueltype, and met color. so we can just directly remove that six rows if they have nothing in that six rows but if there is no pattern in our dataframe for the missing values so then we have to deal for then we have to deal column wise for the missing values we have to deal column wise for each column we have to delete one by one.  
<br>
<br>

So, for checking what we can do like we can convert our first we can create a dataframe for all the missing values and then we can convert it to a csv file and then we can go and check in with application(Excel)


<b>missing=df2[df2.isnull().any(axis=1)]</b> <br>
<li> It means that if there are rows which has more than one missing value give methat type of rows</li>

In [9]:
missing=df2[df2.isnull().any(axis=1)]
print(missing)
print(missing.shape)

      Price   Age       KM FuelType    HP  MetColor  Automatic    CC Doors  \
2     13950  24.0  41711.0   Diesel  90.0       NaN          0  2000     3
6     16900  27.0      NaN   Diesel   NaN       NaN          0  2000     3
7     18600  30.0  75889.0      NaN  90.0       1.0          0  2000     3
9     12950  23.0  71138.0   Diesel   NaN       NaN          0  1900     3
15    22000  28.0  18739.0   Petrol   NaN       0.0          0  1800     3
...     ...   ...      ...      ...   ...       ...        ...   ...   ...
1428   8450  72.0      NaN   Petrol  86.0       NaN          0  1300     3
1431   7500   NaN  20544.0   Petrol  86.0       1.0          0  1300     3
1432  10845  72.0      NaN   Petrol  86.0       0.0          0  1300     3
1433   8500   NaN  17016.0   Petrol  86.0       0.0          0  1300     3
1434   7250  70.0      NaN      NaN  86.0       1.0          0  1300     3

      Weight
2       1165
6       1245
7       1245
9       1105
15      1185
...      ...
1428    1015
1431    1025
1432    1015
1433    1015
1434    1015

[340 rows x 10 columns]
(340, 10)

In [11]:
# # Export to csv
# missing.to_csv("missing1.csv",index=True)

# # There are no missing value pattern in csv file

# Approaches to fill the missing values
<table>
    <tr style="background-color:white;color:black">
        <th >Two ways of approach</th>
    </tr>
    <tr>
        <td style="background-color: yellow;color:black">Fill the missing values by mean / median,<br> 
            in case of numerical variable</td> 
        <td>Fill the missing values with the class which has maximum count,<br> in case of categorical variable</td>
    </tr>
</table>

<h2> Imputing Missing Values</h2>

for imputing the missing values,we have to look description to know wether the numerical variable should<br> be imputed with mean and median.

<b>DataFrame.describe()</b> <hr>
Generate descriptive statistics that summarize the central tendency, dispersion and shape of a dataset's distribution, excluding NaN values.

In [12]:
df2.describe()

,Price,Age,KM,HP,MetColor,Automatic,CC,Weight
count,1436.000000,1336.000000,1421.000000,1430.000000,1286.000000,1436.000000,1436.000000,1436.00000
mean,10730.824513,55.672156,68647.239972,101.478322,0.674961,0.055710,1566.827994,1072.45961
std,3626.964585,18.589804,37333.023589,14.768255,0.468572,0.229441,187.182436,52.64112
min,4350.000000,1.000000,1.000000,69.000000,0.000000,0.000000,1300.000000,1000.00000
25%,8450.000000,43.000000,43210.000000,90.000000,0.000000,0.000000,1400.000000,1040.00000
50%,9900.000000,60.000000,63634.000000,110.000000,1.000000,0.000000,1600.000000,1070.00000
75%,11950.000000,70.000000,87000.000000,110.000000,1.000000,0.000000,1600.000000,1085.00000
max,32500.000000,80.000000,243000.000000,192.000000,1.000000,1.000000,2000.000000,1615.00000

As we can see that age does not have that much difference in mean & median(50%), so here we can use the mean method.<br>
And in 'KM'-KiloMeter there is huge difference between in mean and median, so we can use the median here and difference may be becoz of outliers.<br>
In 'HP' there is very less difference we can use the mean here

In [13]:
df2['Age'].mean()

np.float64(55.67215568862275)

<h1>To fill NA/NaN values using the specified value</h1>

<b>DataFrame.fillna()</b>

In [15]:
df2['Age'].fillna(df2['Age'].mean(), inplace=True)

/tmp/ipykernel_7207/2049159914.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Age'].fillna(df2['Age'].mean(), inplace=True)

In [16]:
df2.isnull().sum()

Price          0
Age            0
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [17]:
df2['KM'].median()

np.float64(63634.0)

In [18]:
df2['KM'].fillna(df2['KM'].median(), inplace=True)

/tmp/ipykernel_7207/1532224330.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['KM'].fillna(df2['KM'].median(), inplace=True)

In [19]:
df2.isnull().sum()

Price          0
Age            0
KM             0
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [23]:
df2['HP'].mean()

np.float64(101.47832167832168)

In [24]:
df2['HP'].fillna(df2['HP'].mean(),inplace=True)

/tmp/ipykernel_7207/1069552240.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['HP'].fillna(df2['HP'].mean(),inplace=True)

In [25]:
df2.isnull().sum()

Price          0
Age            0
KM             0
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

# WE are feeling the missing value for categorical variable using value_counts(), mode
# Imputing missing values of 'FuelType'
<b>Syntax:series.value_counts()</b> <br>
This method is going to return us the total value of the means it is going to return the occurence the total occurence of all the variables means all the values present inside the column

In [30]:
df2['FuelType'].value_counts()

#excluding the na values by default

FuelType
Petrol    1177
Diesel     144
CNG         15
Name: count, dtype: int64

In [32]:
df2['FuelType'].value_counts().index[0] # finding highest occurece through index

#By using this we are going to fill our all the missing values in df in our dataframe in the variable fueltype

'Petrol'

In [33]:
df2["FuelType"].fillna(df2['FuelType'].value_counts().index[0], inplace=True)

/tmp/ipykernel_7207/3018884693.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2["FuelType"].fillna(df2['FuelType'].value_counts().index[0], inplace=True)

In [34]:
df2.isnull().sum()

Price          0
Age            0
KM             0
FuelType       0
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

# Imputting missing values of 'MetColor'

--> For imputing all the missing values for the Metcolor i will use the mode method.<br>
--> Mode is the value that appers the most frequency in a dataset.

In [37]:
df2['MetColor'].mode()

#most occurence is 1 here, 0-false(no metallic color), 1-true(mettalic color)

0    1.0
Name: MetColor, dtype: float64

In [38]:
# if we have multiple value with high occurence we use them with index

df2['MetColor'].mode()[0]

np.float64(1.0)

In [39]:
# Access with index
df2['MetColor'].fillna(df2['MetColor'].mode()[0],inplace=True)

/tmp/ipykernel_7207/1078026252.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['MetColor'].fillna(df2['MetColor'].mode()[0],inplace=True)

In [40]:
df2.isnull().sum()

Price        0
Age          0
KM           0
FuelType     0
HP           0
MetColor     0
Automatic    0
CC           0
Doors        0
Weight       0
dtype: int64

# Suppose we have 50-60 column with missing values for numerical and categorical value

In [41]:
df3 = df.copy()
df3.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [43]:
# index[0] to check first value becoz most frequent value on 1st value
df3 = df3.apply(lambda x:x.fillna(x.mean()) if x.dtype == "float" else x.fillna(x.value_counts().index[0]))
df3.isnull().sum()

Price        0
Age          0
KM           0
FuelType     0
HP           0
MetColor     0
Automatic    0
CC           0
Doors        0
Weight       0
dtype: int64

In [44]:
# apply method is used to apply the function on all the column and row